# Data-Driven Decision Making in SQL

## Course Description
- Learn how to use SQL to support decision making based on a case study about an online movie rental company with a database about customer information, movie ratings, background information on actors and more. 
- Learn to apply SQL queries to study for example customer preferences, customer engagement, and sales development. 
- SQL extensions for online analytical processing (OLAP), which makes it easier to obtain key insights from multidimensional aggregated data.

In [5]:
import pandas as pd
import sqlalchemy
import psycopg2
from sqlalchemy.engine import create_engine
engine = create_engine('postgresql://postgres:123456@localhost:5432/MovieNow', paramstyle='format') 
%reload_ext sql
%sql postgresql://postgres:123456@localhost:5432/MovieNow
conn = psycopg2.connect(host='localhost',
                       dbname='MovieNow',
                       user='postgres',
                       password='123456',
                       port='5432')  
cursor = conn.cursor()

In [8]:
df1  = pd.read_csv('actsin_181127_2.csv')
df2 = pd.read_csv('actors_181127_2.csv')
df3 = pd.read_csv('customers_181127_2.csv')
df4= pd.read_csv('movies_181127_2.csv')
df5 = pd.read_csv('renting_181127_2.csv')

In [9]:
%%sql
DROP TABLE IF EXISTS "actsin";
DROP TABLE IF EXISTS "actors";
DROP TABLE IF EXISTS "customers";
DROP TABLE IF EXISTS "movies";
DROP TABLE IF EXISTS "renting";

 * postgresql://postgres:***@localhost:5432/MovieNow
Done.
Done.
Done.
Done.
Done.

[]

In [10]:
df1.to_sql('actsin', engine)
df2.to_sql('actors', engine)
df3.to_sql('customers', engine)
df4.to_sql('movies', engine)
df5.to_sql('renting', engine)

In [5]:
%%sql

SELECT table_name
FROM information_schema.tables
WHERE table_schema = 'public'
ORDER BY table_name;

 * postgresql://postgres:***@localhost:5432/MovieNow
5 rows affected.

[('actors',), ('actsin',), ('customers',), ('movies',), ('renting',)]

In [6]:
%%sql
select * from renting limit 5;

 * postgresql://postgres:***@localhost:5432/MovieNow
5 rows affected.

[(0, 1, 41, 8, None, '2018-10-09'),
 (1, 2, 10, 29, 10.0, '2017-03-01'),
 (2, 3, 108, 45, 4.0, '2018-06-08'),
 (3, 4, 39, 66, 8.0, '2018-10-22'),
 (4, 5, 104, 15, 7.0, '2019-03-18')]

In [7]:
%%sql
select * from actors limit 5;

 * postgresql://postgres:***@localhost:5432/MovieNow
5 rows affected.

[(0, 1, 'Abbie Cornish', 1982.0, 'Australia', 'female'),
 (1, 2, 'Adam Sandler', 1966.0, 'USA', 'male'),
 (2, 3, 'Al Pacino', 1940.0, 'USA', 'male'),
 (3, 4, 'Amy Adams', 1974.0, 'USA', 'female'),
 (4, 5, 'Andrea Riseborough', 1981.0, 'British', 'female')]

In [8]:
%%sql
select * from actsin limit 5;

 * postgresql://postgres:***@localhost:5432/MovieNow
5 rows affected.

[(0, 1, 37, 1), (1, 2, 56, 2), (2, 3, 10, 3), (3, 4, 14, 3), (4, 5, 29, 3)]

In [9]:
%%sql
select * from customers limit 5;

 * postgresql://postgres:***@localhost:5432/MovieNow
5 rows affected.

[(0, 1, 'Robert Bohm', 'Austria', 'male', '7/30/1980', '9/2/2018'),
 (1, 2, 'Wolfgang Ackermann', 'Austria', 'male', '11/17/1971', '10/15/2018'),
 (2, 3, 'Daniela Herzog', 'Austria', 'female', '8/7/1974', '2/14/2019'),
 (3, 4, 'Julia Jung', 'Austria', 'female', '1/4/1991', '11/22/2017'),
 (4, 5, 'Juliane Kirsch', 'Austria', 'female', '3/1/1977', '12/16/2018')]

In [10]:
%%sql
select * from movies limit 5;

 * postgresql://postgres:***@localhost:5432/MovieNow
5 rows affected.

[(0, 1, "One Night at McCool's", 'Comedy', 93, 2001, 2.09),
 (1, 2, 'Swordfish', 'Drama', 99, 2001, 2.19),
 (2, 3, 'What Women Want', 'Comedy', 127, 2001, 2.59),
 (3, 4, 'Training Day', 'Drama', 122, 2001, 1.79),
 (4, 5, 'The Fellowship of the Ring', 'Science Fiction & Fantasy', 178, 2001, 2.59)]

In [11]:
%%sql
SELECT *
FROM renting
WHERE date_renting BETWEEN '2018-04-01' AND '2018-08-31'
ORDER BY date_renting DESC
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/MovieNow
5 rows affected.

[(75, 76, 112, 10, None, '2018-08-31'),
 (278, 279, 21, 62, None, '2018-08-30'),
 (550, 551, 86, 13, 8.0, '2018-08-29'),
 (38, 39, 25, 52, None, '2018-08-28'),
 (257, 258, 65, 44, 8.0, '2018-08-28')]

### Aggregations - summarizing data

In [12]:

%%sql

SELECT count(*) -- Count the total number of customers
FROM customers
WHERE date_of_birth::date BETWEEN '1980-01-01' AND '1989-12-31' ; -- Select customers born between 1980-01-01 and 1989-12-31

 * postgresql://postgres:***@localhost:5432/MovieNow
1 rows affected.

[(34,)]

In [13]:
%%sql
SELECT COUNT(*)   -- Count the total number of customers
FROM customers
WHERE country ='Germany';

 * postgresql://postgres:***@localhost:5432/MovieNow
1 rows affected.

[(0,)]

In [14]:
%%sql
SELECT COUNT(DISTINCT country)   -- Count the number of countries
FROM customers;

 * postgresql://postgres:***@localhost:5432/MovieNow
1 rows affected.

[(11,)]

## Decision Making with simple SQL queries
### First account for each country.
Conduct an analysis to see when the first customer accounts were created for each country.

In [15]:
%%sql
SELECT country, -- For each country report the earliest date when an account was created
	min(date_account_start::date) AS first_account
FROM customers
GROUP BY country
ORDER BY first_account;

 * postgresql://postgres:***@localhost:5432/MovieNow
11 rows affected.

[('France', datetime.date(2017, 1, 13)),
 ('Hungary', datetime.date(2017, 1, 18)),
 ('Belgium', datetime.date(2017, 1, 28)),
 ('Slovenia', datetime.date(2017, 1, 31)),
 ('Spain', datetime.date(2017, 2, 14)),
 ('Italy', datetime.date(2017, 2, 28)),
 ('Poland', datetime.date(2017, 3, 3)),
 ('Great Britan', datetime.date(2017, 3, 31)),
 ('Denmark', datetime.date(2017, 4, 30)),
 ('USA', datetime.date(2017, 9, 13)),
 ('Austria', datetime.date(2017, 11, 22))]

### Average movie ratings
For each movie the average rating, the number of ratings and the number of views has to be reported.

In [16]:
%%sql
SELECT movie_id, 
      ROUND( AVG(rating)::numeric,2) AS avg_rating,
      COUNT(rating) AS number_ratings,
      COUNT(*) AS number_renting
FROM renting
GROUP BY movie_id
ORDER BY avg_rating; -- Order by average rating in decreasing order

 * postgresql://postgres:***@localhost:5432/MovieNow
71 rows affected.

[(56, Decimal('5.67'), 3, 4),
 (43, Decimal('6.00'), 1, 4),
 (59, Decimal('6.00'), 2, 5),
 (68, Decimal('6.33'), 3, 7),
 (14, Decimal('6.50'), 6, 11),
 (15, Decimal('6.50'), 2, 6),
 (66, Decimal('6.80'), 5, 6),
 (10, Decimal('6.83'), 6, 11),
 (45, Decimal('7.00'), 6, 8),
 (20, Decimal('7.00'), 1, 4),
 (21, Decimal('7.00'), 1, 5),
 (36, Decimal('7.00'), 8, 13),
 (52, Decimal('7.14'), 7, 12),
 (19, Decimal('7.20'), 5, 9),
 (32, Decimal('7.25'), 4, 9),
 (31, Decimal('7.25'), 4, 7),
 (1, Decimal('7.25'), 4, 8),
 (2, Decimal('7.25'), 4, 6),
 (30, Decimal('7.25'), 4, 9),
 (46, Decimal('7.25'), 4, 6),
 (44, Decimal('7.33'), 6, 9),
 (25, Decimal('7.50'), 8, 13),
 (55, Decimal('7.50'), 2, 2),
 (67, Decimal('7.67'), 3, 6),
 (37, Decimal('7.67'), 3, 9),
 (70, Decimal('7.75'), 4, 7),
 (41, Decimal('7.80'), 10, 15),
 (69, Decimal('7.80'), 5, 8),
 (12, Decimal('7.83'), 6, 11),
 (4, Decimal('7.89'), 9, 14),
 (7, Decimal('8.00'), 5, 10),
 (61, Decimal('8.00'), 6, 12),
 (17, Decimal('8.00'), 1, 4),
 (28, Decimal('8.00'), 8, 10),
 (29, Decimal('8.00'), 7, 11),
 (34, Decimal('8.00'), 6, 8),
 (35, Decimal('8.00'), 3, 6),
 (39, Decimal('8.00'), 4, 6),
 (50, Decimal('8.00'), 8, 9),
 (13, Decimal('8.00'), 4, 5),
 (53, Decimal('8.00'), 4, 9),
 (71, Decimal('8.00'), 4, 6),
 (23, Decimal('8.00'), 7, 11),
 (8, Decimal('8.00'), 1, 5),
 (40, Decimal('8.17'), 6, 10),
 (54, Decimal('8.17'), 6, 9),
 (62, Decimal('8.25'), 4, 7),
 (64, Decimal('8.25'), 4, 7),
 (27, Decimal('8.29'), 7, 13),
 (58, Decimal('8.33'), 3, 10),
 (9, Decimal('8.33'), 3, 5),
 (26, Decimal('8.33'), 3, 10),
 (24, Decimal('8.40'), 5, 8),
 (33, Decimal('8.40'), 5, 10),
 (51, Decimal('8.43'), 7, 7),
 (60, Decimal('8.50'), 2, 4),
 (16, Decimal('8.60'), 5, 11),
 (49, Decimal('8.64'), 11, 13),
 (38, Decimal('8.67'), 3, 6),
 (22, Decimal('8.67'), 6, 8),
 (47, Decimal('8.75'), 4, 6),
 (6, Decimal('8.80'), 5, 6),
 (57, Decimal('8.83'), 6, 9),
 (65, Decimal('9.00'), 5, 5),
 (3, Decimal('9.00'), 2, 11),
 (18, Decimal('9.00'), 5, 7),
 (63, Decimal('9.33'), 6, 11),
 (42, Decimal('9.60'), 5, 10),
 (5, Decimal('9.75'), 4, 8),
 (48, Decimal('10.00'), 2, 5),
 (11, None, 0, 6)]

### Average rating per customer
Calculate 
- The average rating given by each customer. 
- The number of ratings and the number of movie rentals per customer. 
- Report these summary statistics only for customers with more than 7 movie rentals and order them in ascending order by the average rating.

In [17]:
%%sql
SELECT customer_id, -- Report the customer_id
      round(avg(rating)::numeric,2) as avg_rating,  -- Report the average rating per customer
      count(rating) as number_of_rating,  -- Report the number of ratings per customer
      count(*)  as number_of_renting-- Report the number of movie rentals per customer
FROM renting
GROUP BY customer_id
HAVING count(*) > 7  -- Select only customers with more than 7 movie rentals
ORDER BY avg(rating); -- Order by the average rating in ascending order

 * postgresql://postgres:***@localhost:5432/MovieNow
22 rows affected.

[(104, Decimal('6.25'), 4, 8),
 (28, Decimal('6.71'), 7, 11),
 (111, Decimal('7.00'), 3, 10),
 (113, Decimal('7.00'), 7, 15),
 (25, Decimal('7.20'), 5, 10),
 (21, Decimal('7.33'), 6, 14),
 (92, Decimal('7.57'), 7, 11),
 (49, Decimal('7.63'), 8, 13),
 (35, Decimal('7.67'), 6, 9),
 (52, Decimal('7.88'), 8, 9),
 (108, Decimal('8.00'), 6, 10),
 (114, Decimal('8.00'), 6, 11),
 (66, Decimal('8.00'), 7, 10),
 (93, Decimal('8.40'), 5, 8),
 (26, Decimal('8.40'), 5, 10),
 (94, Decimal('8.71'), 7, 10),
 (121, Decimal('8.75'), 4, 9),
 (7, Decimal('9.00'), 4, 9),
 (61, Decimal('9.20'), 5, 8),
 (8, Decimal('9.25'), 4, 8),
 (99, Decimal('9.25'), 4, 8),
 (65, Decimal('9.33'), 3, 9)]

### Join renting and customers
- add customer information to the data in the table renting.

In [18]:
%%sql
SELECT avg(r.rating) -- Average ratings of customers from Belgium
FROM renting AS r
LEFT JOIN customers AS c
ON r.customer_id = c.customer_id
WHERE c.country='Belgium';

 * postgresql://postgres:***@localhost:5432/MovieNow
1 rows affected.

[(8.9,)]

### Aggregating revenue, rentals and active customers

The management of MovieNow wants to report key performance indicators (KPIs) for the performance of the company in 2018. They are interested in measuring the financial successes as well as user engagement. Important KPIs are, therefore, the profit coming from movie rentals, the number of movie rentals and the number of active customers.

In [19]:
%%sql

SELECT 
    SUM(m.renting_price) as rentals_revenue, 
    COUNT(*) as renting_number, 
    COUNT(DISTINCT r.customer_id) as customers_number
FROM renting AS r
LEFT JOIN movies AS m
ON r.movie_id = m.movie_id

WHERE date_renting::date BETWEEN '2018-01-01' AND '2018-12-31'  ;

 * postgresql://postgres:***@localhost:5432/MovieNow
1 rows affected.

[(658.02, 298, 93)]

### Movies and actors
- give an overview of which actors play in which movie.

In [20]:
%%sql
SELECT m.title, -- Create a list of movie titles and actor names
       a.name
FROM actsin as ai
LEFT JOIN movies AS m
ON m.movie_id = ai.movie_id
LEFT JOIN actors AS a
ON a.actor_id = ai.actor_id
Limit 10;

 * postgresql://postgres:***@localhost:5432/MovieNow
10 rows affected.

[('Candy', 'Abbie Cornish'),
 ('Jack and Jill', 'Adam Sandler'),
 ('Simone', 'Al Pacino'),
 ('The Recruit', 'Al Pacino'),
 ('Two for the Money', 'Al Pacino'),
 ('Jack and Jill', 'Al Pacino'),
 ('The Fighter', 'Amy Adams'),
 ('Brighton Rock', 'Andrea Riseborough'),
 ('The Royal Tenenbaums', 'Anjelica Huston'),
 ('Sleepwalking', 'Annasophia Robb')]

### Income from movies
How much income did each movie generate?

In [21]:
%%sql
SELECT rm.title, 
       sum(rm.renting_price) AS income_movie
FROM
       (SELECT m.title,  
               m.renting_price
       FROM renting AS r
       LEFT JOIN movies AS m
       ON r.movie_id=m.movie_id) AS rm
    
GROUP BY rm.title
ORDER BY income_movie desc
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/MovieNow
10 rows affected.

[('Bridget Jones - The Edge of Reason', 37.57),
 ('Fair Game', 34.68),
 ('The Kingdom', 31.35),
 ('Two for the Money', 30.69),
 ('Simone', 29.59),
 ('Django Unchained', 29.59),
 ('What Women Want', 28.49),
 ('Monster', 27.17),
 ('The Two Towers', 26.29),
 ('A Good Woman', 26.01)]

### Age of actors from the USA
Report the date of birth of the oldest and youngest US actor and actress.

In [22]:
%%sql
SELECT a.gender, -- Report for male and female actors from the USA 
       min(a.year_of_birth) as oldest, -- The year of birth of the oldest actor
       max(a.year_of_birth) as youngest -- The year of birth of the youngest actor
FROM
   (SELECT * -- Use a subsequen SELECT to get all information about actors from the USA
   FROM actors
   WHERE nationality ='USA') AS a -- Give the table the name a
GROUP BY gender;

 * postgresql://postgres:***@localhost:5432/MovieNow
2 rows affected.

[('female', 1945.0, 1993.0), ('male', 1930.0, 1992.0)]

### Identify favorite movies for a group of customers
Which is the favorite movie on MovieNow for all customers born in the 70s.

In [23]:
%%sql

SELECT m.title, 
    COUNT(*),
    AVG(r.rating)
FROM renting AS r
LEFT JOIN customers AS c

ON c.customer_id = r.customer_id

LEFT JOIN movies AS m
ON m.movie_id = r.movie_id

WHERE c.date_of_birth::date BETWEEN '1970-01-01' AND '1979-12-31'

GROUP BY m.title
HAVING count(*) >1 -- Remove movies with only one rental
ORDER BY avg desc, count;

 * postgresql://postgres:***@localhost:5432/MovieNow
47 rows affected.

[('Waking Up in Reno', 2, None),
 ('Harry Potter and the Deathly Hallows – Part 2', 2, None),
 ('Ray', 2, None),
 ('Showtime', 5, None),
 ("One Night at McCool's", 2, 10.0),
 ('The Fellowship of the Ring', 2, 10.0),
 ("I'm Not There", 2, 10.0),
 ('No Country for Old Men', 3, 10.0),
 ('Django Unchained', 4, 10.0),
 ('The Fighter', 4, 10.0),
 ('Secondhand Lions', 4, 9.66666666666667),
 ("Winter's Bone", 2, 9.5),
 ("Fool's Gold", 4, 9.33333333333333),
 ('Burn After Reading', 2, 9.0),
 ('Morning Glory', 2, 9.0),
 ('25th Hour', 2, 9.0),
 ('The Help', 3, 9.0),
 ('Failure to Launch', 4, 8.66666666666667),
 ('Sleepwalking', 2, 8.5),
 ('Black Death', 3, 8.5),
 ('Young Adult', 4, 8.5),
 ('Bridget Jones - The Edge of Reason', 6, 8.25),
 ('The Royal Tenenbaums', 2, 8.0),
 ('Harry Potter and the Half-Blood Prince', 3, 8.0),
 ('Fair Game', 3, 8.0),
 ('Welcome to Mooseport', 4, 8.0),
 ('Monster', 5, 8.0),
 ('Harry Potter and the Order of the Phoenix', 3, 7.5),
 ('Harry Potter and the Prisoner of Azkaban', 4, 7.5),
 ('The Frozen Ground', 4, 7.5),
 ('Two for the Money', 4, 7.33333333333333),
 ('A Good Woman', 4, 7.33333333333333),
 ('V for Vendetta', 2, 7.0),
 ('Training Day', 3, 7.0),
 ('Capote', 3, 7.0),
 ('Happy Feet', 3, 7.0),
 ('The Two Towers', 3, 7.0),
 ('Candy', 3, 7.0),
 ('Shall We Dance', 4, 7.0),
 ('The Kingdom', 5, 6.66666666666667),
 ('The Hunger Games', 2, 6.5),
 ('World Trade Center', 3, 6.5),
 ('Harry Potter and the Deathly Hallows – Part 1', 2, 6.0),
 ("Something's Gotta Give", 3, 6.0),
 ('Then She Found Me', 4, 6.0),
 ('Simone', 5, 6.0),
 ('The Recruit', 2, 5.0)]

### Identify favorite actors for Spain
- Explore actor popularity in Spain

In [24]:
%%sql
SELECT a.name,  c.gender,
       COUNT(*) AS number_views, 
       AVG(r.rating) AS avg_rating

        FROM renting as r
LEFT JOIN customers AS c
ON r.customer_id = c.customer_id
LEFT JOIN actsin as ai
ON r.movie_id = ai.movie_id
LEFT JOIN actors as a
ON ai.actor_id = a.actor_id

WHERE c.country ='Spain' -- Select only customers from Spain
GROUP BY a.name, c.gender

HAVING AVG(r.rating) IS NOT NULL 
       AND COUNT(*) > 5 
ORDER BY avg_rating DESC, number_views DESC;

 * postgresql://postgres:***@localhost:5432/MovieNow
4 rows affected.

[('Catherine Keener', 'female', 6, 8.0),
 ('Emma Watson', 'male', 7, 7.6),
 ('Daniel Radcliffe', 'male', 7, 7.6),
 ('Rupert Grint', 'male', 7, 7.6)]

### KPIs per country
- The total number of movie rentals, 
- The average rating of all movies and 
- The total revenue for each country since the beginning of 2019.

In [25]:
%%sql
SELECT 
    c.country,                    
    count(*) AS number_renting, 
    round(avg(r.rating)::numeric,2) AS average_rating, 
    sum(renting_price) AS revenue    
FROM renting AS r
LEFT JOIN customers AS c
ON c.customer_id = r.customer_id
LEFT JOIN movies AS m
ON m.movie_id = r.movie_id

WHERE date_renting >= '2019-01-01'
GROUP BY c.country
ORDER BY revenue desc;

 * postgresql://postgres:***@localhost:5432/MovieNow
11 rows affected.

[('Italy', 30, Decimal('8.24'), 69.9),
 ('Spain', 26, Decimal('8.08'), 57.94),
 ('France', 23, Decimal('7.53'), 51.07),
 ('Poland', 21, Decimal('8.13'), 49.29),
 ('Slovenia', 14, Decimal('8.00'), 30.26),
 ('Hungary', 11, Decimal('7.17'), 25.89),
 ('Great Britan', 9, Decimal('7.20'), 17.91),
 ('Denmark', 7, Decimal('7.71'), 14.63),
 ('USA', 6, Decimal('9.00'), 14.54),
 ('Belgium', 7, Decimal('9.00'), 13.13),
 ('Austria', 5, Decimal('7.33'), 9.95)]

## Data Driven Decision Making with advanced SQL queries

### Often rented movies
- Make a list of movies excluding those which are hardly ever watched. This list of movies will be used for advertising. List all movies with more than 5 views using a nested query which is a powerful tool to implement selection conditions.

In [26]:
%%sql
SELECT *
FROM movies
WHERE movie_id IN  
    (SELECT movie_id
    FROM renting
    GROUP BY movie_id
    HAVING COUNT(*) > 5)

 * postgresql://postgres:***@localhost:5432/MovieNow
58 rows affected.

[(0, 1, "One Night at McCool's", 'Comedy', 93, 2001, 2.09),
 (1, 2, 'Swordfish', 'Drama', 99, 2001, 2.19),
 (2, 3, 'What Women Want', 'Comedy', 127, 2001, 2.59),
 (3, 4, 'Training Day', 'Drama', 122, 2001, 1.79),
 (4, 5, 'The Fellowship of the Ring', 'Science Fiction & Fantasy', 178, 2001, 2.59),
 (5, 6, "Harry Potter and the Philosopher's Stone", 'Science Fiction & Fantasy', 152, 2001, 2.69),
 (6, 7, 'The Royal Tenenbaums', 'Comedy', 110, 2002, 1.89),
 (9, 10, 'Simone', 'Drama', 117, 2002, 2.69),
 (10, 11, 'Showtime', 'Comedy', 95, 2002, 1.79),
 (11, 12, 'The Two Towers', 'Science Fiction & Fantasy', 179, 2002, 2.39),
 (13, 14, 'The Recruit', 'Mystery & Suspense', 115, 2003, 1.69),
 (14, 15, "Something's Gotta Give", 'Comedy', 128, 2003, 1.69),
 (15, 16, '25th Hour', 'Drama', 135, 2003, 1.59),
 (17, 18, 'Secondhand Lions', 'Drama', 111, 2003, 1.69),
 (18, 19, '21 Grams', 'Drama', 124, 2003, 2.09),
 (21, 22, 'Imagining Argentina', 'Art House & International', 107, 2004, 2.59),
 (22, 23, 'Shall We Dance', 'Drama', 106, 2004, 1.69),
 (23, 24, 'Welcome to Mooseport', 'Comedy', 110, 2004, 2.89),
 (24, 25, 'Bridget Jones - The Edge of Reason', 'Drama', 108, 2004, 2.89),
 (25, 26, 'Ray', 'Drama', 152, 2004, 2.59),
 (26, 27, 'Monster', 'Drama', 109, 2004, 2.09),
 (27, 28, 'Harry Potter and the Prisoner of Azkaban', 'Science Fiction & Fantasy', 142, 2004, 1.69),
 (28, 29, 'Two for the Money', 'Drama', 122, 2005, 2.79),
 (29, 30, 'Capote', 'Drama', 114, 2005, 2.39),
 (30, 31, 'Harry Potter and the Goblet of Fire', 'Science Fiction & Fantasy', 157, 2005, 2.69),
 (31, 32, 'A Good Woman', 'Drama', 93, 2006, 2.89),
 (32, 33, 'V for Vendetta', 'Drama', 132, 2006, 1.59),
 (33, 34, 'Failure to Launch', 'Drama', 97, 2006, 1.99),
 (34, 35, 'Happy Feet', 'Animation', 108, 2006, 1.79),
 (35, 36, 'World Trade Center', 'Drama', 129, 2006, 1.59),
 (36, 37, 'Candy', 'Drama', 116, 2006, 1.59),
 (37, 38, 'The Lake House', 'Drama', 99, 2006, 2.49),
 (38, 39, "I'm Not There", 'Drama', 135, 2007, 1.79),
 (39, 40, 'Then She Found Me', 'Drama', 100, 2007, 1.99),
 (40, 41, 'The Kingdom', 'Drama', 110, 2007, 2.09),
 (41, 42, 'No Country for Old Men', 'Drama', 122, 2007, 1.49),
 (43, 44, 'Harry Potter and the Order of the Phoenix', 'Science Fiction & Fantasy', 138, 2007, 2.49),
 (44, 45, 'Burn After Reading', 'Drama', 96, 2008, 2.39),
 (45, 46, 'Sleepwalking', 'Drama', 101, 2008, 1.79),
 (46, 47, "Fool's Gold", 'Action & Adventure', 112, 2008, 2.69),
 (48, 49, 'Harry Potter and the Half-Blood Prince', 'Science Fiction & Fantasy', 153, 2009, 1.59),
 (49, 50, "Winter's Bone", 'Drama', 100, 2010, 2.69),
 (50, 51, 'Morning Glory', 'Comedy', 107, 2010, 2.99),
 (51, 52, 'Fair Game', 'Drama', 108, 2010, 2.89),
 (52, 53, 'The Fighter', 'Other', 116, 2010, 2.49),
 (53, 54, 'Harry Potter and the Deathly Hallows – Part 1', 'Science Fiction & Fantasy', 146, 2010, 2.79),
 (56, 57, 'Young Adult', 'Drama', 94, 2011, 1.99),
 (57, 58, 'The Help', 'Drama', 146, 2011, 2.49),
 (60, 61, 'Harry Potter and the Deathly Hallows – Part 2', 'Science Fiction & Fantasy', 130, 2011, 1.99),
 (61, 62, 'The Sessions', 'Drama', 95, 2012, 2.29),
 (62, 63, 'Django Unchained', 'Other', 165, 2012, 2.69),
 (63, 64, 'Cloud Atlas', 'Drama', 172, 2012, 2.89),
 (65, 66, 'The Hunger Games', 'Drama', 142, 2012, 1.59),
 (66, 67, 'White House Down', 'Drama', 131, 2013, 1.59),
 (67, 68, 'The Company You Keep', 'Mystery & Suspense', 125, 2013, 2.39),
 (68, 69, 'The Frozen Ground', 'Mystery & Suspense', 105, 2013, 2.49),
 (69, 70, 'Captain Phillips', 'Drama', 134, 2013, 1.59),
 (70, 71, 'Rio 2', 'Animation', 101, 2014, 1.79)]

### Frequent customers
Report a list of customers who frequently rent movies on MovieNow.

In [30]:
%%sql
SELECT *
FROM customers
WHERE customer_id IN      -- Select all customers with more than 10 movie rentals
     (SELECT customer_id
     FROM renting
     GROUP BY customer_id
     HAVING count(*)>10);

 * postgresql://postgres:***@localhost:5432/MovieNow
6 rows affected.

[(20, 21, 'Avelaine Corbeil', 'France', 'female', '3/17/1986', '6/11/2017'),
 (27, 28, 'Sidney Généreux', 'France', 'male', '12/1/1980', '2/4/2017'),
 (48, 49, 'Havasy Kristof', 'Hungary', 'male', '6/13/1998', '1/18/2017'),
 (91, 92, 'Honorata Nowak', 'Poland', 'female', '5/2/1986', '9/21/2017'),
 (112, 113, 'Lucy Centeno Barrios', 'Spain', 'female', '11/3/1970', '6/13/2017'),
 (113, 114, 'Canela Gaona Lozano', 'Spain', 'female', '4/1/1997', '2/14/2017')]

### Movies with rating above average
 - List popular movie titles with high ratings for the advertising campaign. 
 - Report a list of movies with rating above average.

In [32]:
%%sql
SELECT title 
FROM movies
WHERE movie_id IN
    --# movie_id with rating above average.
    (SELECT movie_id
     FROM renting
     GROUP BY movie_id
     HAVING AVG(rating) > 
         --# high avg rating
        (SELECT AVG(rating)
         FROM renting));

 * postgresql://postgres:***@localhost:5432/MovieNow
40 rows affected.

[('What Women Want',),
 ('The Fellowship of the Ring',),
 ("Harry Potter and the Philosopher's Stone",),
 ('The Royal Tenenbaums',),
 ('Waking Up in Reno',),
 ("11'09''01 September 11",),
 ('Harry Potter and the Chamber of Secrets',),
 ('25th Hour',),
 ('The Human Stain',),
 ('Secondhand Lions',),
 ('Imagining Argentina',),
 ('Shall We Dance',),
 ('Welcome to Mooseport',),
 ('Ray',),
 ('Monster',),
 ('Harry Potter and the Prisoner of Azkaban',),
 ('Two for the Money',),
 ('V for Vendetta',),
 ('Failure to Launch',),
 ('Happy Feet',),
 ('The Lake House',),
 ("I'm Not There",),
 ('Then She Found Me',),
 ('No Country for Old Men',),
 ("Fool's Gold",),
 ('Astro Boy',),
 ('Harry Potter and the Half-Blood Prince',),
 ("Winter's Bone",),
 ('Morning Glory',),
 ('The Fighter',),
 ('Harry Potter and the Deathly Hallows – Part 1',),
 ('Young Adult',),
 ('The Help',),
 ('Black Death',),
 ('Harry Potter and the Deathly Hallows – Part 2',),
 ('The Sessions',),
 ('Django Unchained',),
 ('Cloud Atlas',),
 ('Ghost Rider: Spirit of Vengeance',),
 ('Rio 2',)]

### Analyzing customer behavior
- A new advertising campaign is going to focus on customers who rented fewer than 5 movies. 
- Use a correlated query to extract all customer information for the customers of interest.

In [34]:
%%sql
-- Select customers with less than 5 movie rentals
SELECT *
FROM customers as c
WHERE 5 > 
    (SELECT count(*)
    FROM renting as r
    WHERE r.customer_id = c.customer_id);

 * postgresql://postgres:***@localhost:5432/MovieNow
66 rows affected.

[(1, 2, 'Wolfgang Ackermann', 'Austria', 'male', '11/17/1971', '10/15/2018'),
 (2, 3, 'Daniela Herzog', 'Austria', 'female', '8/7/1974', '2/14/2019'),
 (3, 4, 'Julia Jung', 'Austria', 'female', '1/4/1991', '11/22/2017'),
 (4, 5, 'Juliane Kirsch', 'Austria', 'female', '3/1/1977', '12/16/2018'),
 (5, 6, 'Rowanne Couperus', 'Belgium', 'female', '4/5/1994', '8/26/2018'),
 (8, 9, 'Antal van Looij', 'Belgium', 'male', '6/18/1982', '3/10/2019'),
 (10, 11, 'Yakup Mes', 'Belgium', 'male', '4/28/1978', '2/19/2019'),
 (11, 12, 'Kristine J. Lauritsen', 'Denmark', 'female', '1/14/1994', '12/2/2018'),
 (13, 14, 'Niels M. Holm', 'Denmark', 'male', '12/29/1991', '1/26/2018'),
 (14, 15, 'Jasmin M. Krogh', 'Denmark', 'female', '11/12/1977', '6/20/2018'),
 (15, 16, 'Sofia J. Pedersen', 'Denmark', 'female', '5/27/1990', '10/2/2018'),
 (17, 18, 'Nikolaj L. Jensen', 'Denmark', 'male', '6/3/1995', '1/14/2019'),
 (19, 20, 'Jacqueline Cloutier', 'France', 'female', '9/30/1990', '11/3/2018'),
 (21, 22, 'Delit Perillard', 'France', 'female', '1/10/1970', '11/18/2018'),
 (23, 24, 'Christien Tachel', 'France', 'male', '6/26/1991', '9/21/2018'),
 (26, 27, 'Perrin Patel', 'France', 'male', '10/30/1994', '12/20/2018'),
 (31, 32, "Hayden O'Donnell", 'Great Britan', 'male', '11/7/1991', '11/20/2017'),
 (33, 34, 'Oscar Stanley', 'Great Britan', 'male', '12/1/1993', '3/31/2017'),
 (35, 36, 'Jacob Hope', 'Great Britan', 'male', '8/27/1979', '6/24/2018'),
 (36, 37, 'Sienna Forster', 'Great Britan', 'female', '12/16/1984', '12/9/2018'),
 (38, 39, 'Amy Haynes', 'Great Britan', 'female', '7/28/1975', '1/19/2018'),
 (39, 40, 'Matilda Connor', 'Great Britan', 'female', '12/18/1990', '1/18/2019'),
 (41, 42, 'Takáts Agoti', 'Hungary', 'female', '7/7/1992', '11/8/2018'),
 (42, 43, 'Szôllôs Erzebet', 'Hungary', 'female', '9/4/1995', '8/17/2018'),
 (43, 44, 'Lakatos Mária', 'Hungary', 'female', '11/28/1994', '8/12/2018'),
 (46, 47, 'Kállai Sólyom', 'Hungary', 'male', '10/29/1983', '10/18/2018'),
 (47, 48, 'Mayer Károly', 'Hungary', 'male', '6/2/1991', '2/26/2019'),
 (49, 50, 'Csordás Ármin', 'Hungary', 'male', '11/30/1986', '4/23/2018'),
 (50, 51, 'Sághy Sebes', 'Hungary', 'male', '1/4/1976', '3/15/2017'),
 (52, 53, 'Teresio Panicucci', 'Italy', 'male', '7/21/1999', '11/6/2018'),
 (53, 54, 'Demetrio Palermo', 'Italy', 'male', '10/10/1997', '10/17/2018'),
 (55, 56, 'Dionisio Li Fonti', 'Italy', 'male', '1/11/1998', '2/12/2019'),
 (56, 57, 'Mario Lettiere', 'Italy', 'male', '5/4/1975', '1/30/2018'),
 (58, 59, 'Cristoforo Mancini', 'Italy', 'male', '6/5/1980', '1/12/2018'),
 (59, 60, 'Gloria Folliero', 'Italy', 'female', '3/9/1972', '10/24/2018'),
 (61, 62, 'Gina Lucciano', 'Italy', 'female', '11/29/1985', '5/22/2018'),
 (62, 63, 'Candida Padovano', 'Italy', 'female', '3/21/1976', '10/13/2018'),
 (66, 67, 'Dora Milanesi', 'Italy', 'female', '4/19/1998', '11/22/2018'),
 (67, 68, 'Irma Siciliani', 'Italy', 'female', '1/20/1980', '2/18/2019'),
 (68, 69, 'Violetta Pagnotto', 'Italy', 'female', '5/4/1999', '12/23/2018'),
 (69, 70, 'Annabella Endrizzi', 'Italy', 'female', '7/31/1971', '5/10/2018'),
 (70, 71, 'Donata Bellucci', 'Italy', 'female', '4/2/1981', '11/23/2017'),
 (72, 73, 'Veneranda Milani', 'Italy', 'female', '1/15/1983', '1/15/2018'),
 (73, 74, 'Fausto Sabbatini', 'Italy', 'male', '1/23/1978', '3/16/2018'),
 (74, 75, 'Luca Pinto', 'Italy', 'male', '2/4/1971', '3/9/2019'),
 (75, 76, 'Michelino Barese', 'Italy', 'male', '4/22/1986', '10/6/2017'),
 (76, 77, 'Nunzio Milanesi', 'Italy', 'male', '4/6/1972', '4/27/2018'),
 (79, 80, 'Tymoteusz Nowak', 'Poland', 'male', '7/27/1983', '11/17/2018'),
 (80, 81, 'Jarek Tomaszewski', 'Poland', 'male', '11/30/1972', '11/1/2018'),
 (81, 82, 'Dobrogost Nowakowski', 'Poland', 'male', '8/14/1993', '2/21/2018'),
 (82, 83, 'Marek Zawadzki', 'Poland', 'male', '11/21/1995', '4/1/2019'),
 (84, 85, 'Teofil Szczepański', 'Poland', 'male', '2/25/1979', '10/14/2018'),
 (87, 88, 'Bazyli Kalinowski', 'Poland', 'male', '3/7/1973', '7/26/2018'),
 (89, 90, 'Zosia Adamczyk', 'Poland', 'female', '12/31/1988', '1/13/2019'),
 (94, 95, 'Darija Pokec', 'Slovenia', 'female', '1/28/1992', '5/31/2017'),
 (95, 96, 'Cvijeta Hervatski', 'Slovenia', 'female', '7/15/1981', '9/19/2018'),
 (100, 101, 'Tunjo Krličević', 'Slovenia', 'male', '10/29/1994', '3/23/2019'),
 (104, 105, 'Micael Cardona Razo', 'Spain', 'male', '12/4/1989', '9/10/2017'),
 (105, 106, 'Jenofonte Gaona Mireles', 'Spain', 'male', '12/18/1998', '12/21/2017'),
 (114, 115, 'Merlin Rolón Badillo', 'Spain', 'female', '10/14/1977', '2/21/2019'),
 (115, 116, 'Maciela Casillas Peralta', 'Spain', 'female', '3/30/1991', '12/10/2017'),
 (116, 117, 'Moira Jurado Paez', 'Spain', 'female', '1/30/1996', '11/9/2018'),
 (118, 119, 'Lisa Ibarra Valadez', 'Spain', 'female', '12/8/1998', '3/6/2019'),
 (119, 120, 'Robin J. Himes', 'USA', 'male', '11/30/1988', '8/6/2018'),
 (121, 122, 'Thelma B. Coward', 'USA', 'female', '4/15/1971', '11/27/2018'),
 (122, 123, 'Andrew J. Ramos', 'USA', 'male', '3/11/1994', '12/30/2018')]

### Customers who gave low ratings
- Identify customers who were not satisfied with movies they watched on MovieNow. 
- Report a list of customers with minimum rating smaller than 4.

In [37]:
%%sql
SELECT *
FROM customers as c
WHERE 4 > -- Select all customers with a minimum rating smaller than 4 
    (SELECT MIN(rating)
    FROM renting AS r
    WHERE r.customer_id = c.customer_id);

 * postgresql://postgres:***@localhost:5432/MovieNow
4 rows affected.

[(27, 28, 'Sidney Généreux', 'France', 'male', '12/1/1980', '2/4/2017'),
 (40, 41, 'Zara Mitchell', 'Great Britan', 'female', '7/8/1994', '6/12/2017'),
 (85, 86, 'Albin Jaworski', 'Poland', 'male', '5/1/1984', '12/15/2017'),
 (119, 120, 'Robin J. Himes', 'USA', 'male', '11/30/1988', '8/6/2018')]

### Movies and ratings with correlated queries
Report a list of movies that received the most attention on the movie platform, (i.e. report all movies with more than 5 ratings and all movies with an average rating higher than 8).

In [40]:
%%sql

SELECT *
FROM movies AS m
WHERE 5 < -- Select all movies with more than 5 ratings
    (SELECT COUNT(rating)
    FROM renting AS r
    WHERE r.movie_id = m.movie_id);

 * postgresql://postgres:***@localhost:5432/MovieNow
24 rows affected.

[(3, 4, 'Training Day', 'Drama', 122, 2001, 1.79),
 (9, 10, 'Simone', 'Drama', 117, 2002, 2.69),
 (11, 12, 'The Two Towers', 'Science Fiction & Fantasy', 179, 2002, 2.39),
 (13, 14, 'The Recruit', 'Mystery & Suspense', 115, 2003, 1.69),
 (21, 22, 'Imagining Argentina', 'Art House & International', 107, 2004, 2.59),
 (22, 23, 'Shall We Dance', 'Drama', 106, 2004, 1.69),
 (24, 25, 'Bridget Jones - The Edge of Reason', 'Drama', 108, 2004, 2.89),
 (26, 27, 'Monster', 'Drama', 109, 2004, 2.09),
 (27, 28, 'Harry Potter and the Prisoner of Azkaban', 'Science Fiction & Fantasy', 142, 2004, 1.69),
 (28, 29, 'Two for the Money', 'Drama', 122, 2005, 2.79),
 (33, 34, 'Failure to Launch', 'Drama', 97, 2006, 1.99),
 (35, 36, 'World Trade Center', 'Drama', 129, 2006, 1.59),
 (39, 40, 'Then She Found Me', 'Drama', 100, 2007, 1.99),
 (40, 41, 'The Kingdom', 'Drama', 110, 2007, 2.09),
 (43, 44, 'Harry Potter and the Order of the Phoenix', 'Science Fiction & Fantasy', 138, 2007, 2.49),
 (44, 45, 'Burn After Reading', 'Drama', 96, 2008, 2.39),
 (48, 49, 'Harry Potter and the Half-Blood Prince', 'Science Fiction & Fantasy', 153, 2009, 1.59),
 (49, 50, "Winter's Bone", 'Drama', 100, 2010, 2.69),
 (50, 51, 'Morning Glory', 'Comedy', 107, 2010, 2.99),
 (51, 52, 'Fair Game', 'Drama', 108, 2010, 2.89),
 (53, 54, 'Harry Potter and the Deathly Hallows – Part 1', 'Science Fiction & Fantasy', 146, 2010, 2.79),
 (56, 57, 'Young Adult', 'Drama', 94, 2011, 1.99),
 (60, 61, 'Harry Potter and the Deathly Hallows – Part 2', 'Science Fiction & Fantasy', 130, 2011, 1.99),
 (62, 63, 'Django Unchained', 'Other', 165, 2012, 2.69)]

In [43]:
%%sql

SELECT *
FROM movies AS m
WHERE 5 < -- Select all movies with more than 5 ratings
    (SELECT COUNT(rating)
    FROM renting AS r
    WHERE r.movie_id = m.movie_id)

AND 8< -- Select all movies with an average rating higher than 8
    (SELECT avg(rating)
    FROM renting AS r
    WHERE r.movie_id = m.movie_id);

 * postgresql://postgres:***@localhost:5432/MovieNow
8 rows affected.

[(21, 22, 'Imagining Argentina', 'Art House & International', 107, 2004, 2.59),
 (26, 27, 'Monster', 'Drama', 109, 2004, 2.09),
 (39, 40, 'Then She Found Me', 'Drama', 100, 2007, 1.99),
 (48, 49, 'Harry Potter and the Half-Blood Prince', 'Science Fiction & Fantasy', 153, 2009, 1.59),
 (50, 51, 'Morning Glory', 'Comedy', 107, 2010, 2.99),
 (53, 54, 'Harry Potter and the Deathly Hallows – Part 1', 'Science Fiction & Fantasy', 146, 2010, 2.79),
 (56, 57, 'Young Adult', 'Drama', 94, 2011, 1.99),
 (62, 63, 'Django Unchained', 'Other', 165, 2012, 2.69)]

### Customers with at least one rating
Having active customers is a key performance indicator for MovieNow. 
Make a list of customers who gave at least one rating.

In [48]:
%%sql
SELECT *
FROM customers as c -- Select all customers with at least one rating
WHERE EXISTS
    (SELECT *
    FROM renting AS r
    WHERE rating IS NOT NULL 
    AND r.customer_id = c.customer_id)
Limit 10;

 * postgresql://postgres:***@localhost:5432/MovieNow
10 rows affected.

[(0, 1, 'Robert Bohm', 'Austria', 'male', '7/30/1980', '9/2/2018'),
 (1, 2, 'Wolfgang Ackermann', 'Austria', 'male', '11/17/1971', '10/15/2018'),
 (3, 4, 'Julia Jung', 'Austria', 'female', '1/4/1991', '11/22/2017'),
 (6, 7, 'Annelous Sneep', 'Belgium', 'female', '11/14/1993', '5/12/2018'),
 (7, 8, 'Jaëla van den Dolder', 'Belgium', 'female', '8/31/1990', '2/8/2018'),
 (9, 10, 'Arnout Veenhuis', 'Belgium', 'male', '7/26/1984', '1/28/2017'),
 (10, 11, 'Yakup Mes', 'Belgium', 'male', '4/28/1978', '2/19/2019'),
 (11, 12, 'Kristine J. Lauritsen', 'Denmark', 'female', '1/14/1994', '12/2/2018'),
 (12, 13, 'Thomas T. Nissen', 'Denmark', 'male', '9/25/1975', '4/30/2017'),
 (13, 14, 'Niels M. Holm', 'Denmark', 'male', '12/29/1991', '1/26/2018')]

### Actors in comedies
In order to analyze the diversity of actors in comedies, 
- report a list of actors who play in comedies 
- the number of actors for each nationality playing in comedies.

In [53]:
%%sql
SELECT *
FROM actors as a
WHERE EXISTS
    (SELECT *
     FROM actsin AS ai
     LEFT JOIN movies AS m
     ON m.movie_id = ai.movie_id
     WHERE m.genre = 'Comedy'
     AND ai.actor_id = a.actor_id);

 * postgresql://postgres:***@localhost:5432/MovieNow
28 rows affected.

[(1, 2, 'Adam Sandler', 1966.0, 'USA', 'male'),
 (2, 3, 'Al Pacino', 1940.0, 'USA', 'male'),
 (5, 6, 'Anjelica Huston', 1951.0, 'USA', 'female'),
 (13, 14, 'Bill Nighy', 1949.0, 'British', 'male'),
 (22, 23, 'Charlize Theron', 1975.0, 'South Africa', 'female'),
 (33, 34, 'Diane Keaton', 1946.0, 'USA', 'female'),
 (35, 36, 'Eddie Murphy', 1961.0, 'USA', 'male'),
 (44, 45, 'Frances McDormand', 1957.0, 'USA', 'female'),
 (46, 47, 'Gene Hackman', 1930.0, 'USA', 'male'),
 (49, 50, 'Gwyneth Paltrow', 1972.0, 'USA', 'female'),
 (52, 53, 'Harrison Ford', 1942.0, 'USA', 'male'),
 (55, 56, 'Helen Hunt', 1963.0, 'USA', 'female'),
 (57, 58, 'Hugh Grant', 1960.0, 'British', 'male'),
 (62, 63, 'Jack Nicholson', 1937.0, 'USA', 'male'),
 (79, 80, 'Katie Holmes', 1978.0, 'USA', 'female'),
 (86, 87, 'Liam Neeson', 1952.0, 'Northern Ireland', 'male'),
 (88, 89, 'Liv Tyler', 1977.0, 'USA', 'female'),
 (90, 91, 'Marcia Gay Harden', 1959.0, 'USA', 'female'),
 (91, 92, 'Marisa Tomei', 1964.0, 'USA', 'female'),
 (94, 95, 'Matt Dillon', 1964.0, 'USA', 'male'),
 (96, 97, 'Mel Gibson', 1956.0, 'USA', 'male'),
 (102, 103, 'Natasha Richardson', 1963.0, 'British', 'female'),
 (106, 107, 'Patrick Swayze', 1952.0, 'USA', 'male'),
 (109, 110, 'Paul Reiser', 1956.0, 'USA', 'male'),
 (111, 112, 'Rachel McAdams', 1978.0, 'Canada', 'female'),
 (113, 114, 'Ray Romano', 1957.0, 'USA', 'male'),
 (116, 117, 'Rene Russo', 1954.0, 'USA', 'female'),
 (118, 119, 'Robert De Niro', 1943.0, 'USA', 'male')]

In [50]:
%%sql
SELECT a.nationality,
        count(*)-- Report the nationality and the number of actors for each nationality
FROM actors AS a
WHERE EXISTS
    (SELECT ai.actor_id
     FROM actsin AS ai
     LEFT JOIN movies AS m
     ON m.movie_id = ai.movie_id
     WHERE m.genre = 'Comedy'
     AND ai.actor_id = a.actor_id)
GROUP BY a.nationality;

 * postgresql://postgres:***@localhost:5432/MovieNow
5 rows affected.

[('Northern Ireland', 1),
 ('USA', 22),
 ('South Africa', 1),
 ('Canada', 1),
 ('British', 3)]

### Young actors not coming from the USA
 Identify actors who are not from the USA and actors who were born after 1990.

In [55]:
%%sql
SELECT name, 
       nationality, 
       year_of_birth
FROM actors
WHERE nationality <> 'USA'
INTERSECT -- Select all actors who are not from the USA and who are also born after 1990
SELECT name, 
       nationality, 
       year_of_birth
FROM actors
WHERE year_of_birth > 1990;

 * postgresql://postgres:***@localhost:5432/MovieNow
1 rows affected.

[('Freddie Highmore', 'British', 1992.0)]

### Dramas with high ratings
Make a list of all movies that are in the drama genre and have an average rating higher than 9.

In [56]:
%%sql
SELECT *
FROM movies
WHERE movie_id IN 
   (SELECT movie_id
    FROM movies
    WHERE genre = 'Drama'
    INTERSECT
    SELECT movie_id
    FROM renting
    GROUP BY movie_id
    HAVING AVG(rating)>9);

 * postgresql://postgres:***@localhost:5432/MovieNow
1 rows affected.

[(41, 42, 'No Country for Old Men', 'Drama', 122, 2007, 1.49)]